Repository: 8680-wesnoth/website
Catalog: start/1.10/po/*.po
Languages: gl

source: Default
gl: Estilo predeterminado

source: Battle for Wesnoth 1.10
gl: A batalla por Wesnoth 1.10

source: Wesnoth logo
gl: Logo de A batalla por Wesnoth

source: Battle for Wesnoth 1.10 Release Notes
gl: Notas do lanzamento da versión 1.10 de A batalla por Wesnoth

source: <em>January 2012</em>. It is once again time for that thrill you’ve all been waiting for: the beginning of a new stable series. <em>The Battle for Wesnoth</em> team is proud to release version 1.10 of <em>The Battle for Wesnoth</em>, a <a href='http://www.gnu.org/philosophy/philosophy.html'>free</a> and <a href='http://www.opensource.org/'>open-source</a> turn-based strategy game with a fantasy theme and role-playing elements. The game is available for Microsoft Windows, Mac OS X, and various GNU/Linux distributions.
gl: <em>Xaneiro do 2012</em>. Toca de novo darvos esa emocionante nova pola que tanto tempo levades agardando: o principio dun novo ciclo de versións estábeis. Sentímonos orgullosos de presentarvos a versión 1.10 de <em>A batalla por Wesnoth</em>, un xogo de estratexia por roldas <a href='http://www.gnu.org/philosophy/philosophy.gl.html'>libre</a> e de <a href='http://www.opensource.org/'>código aberto</a> ambientado nun mundo fantástico con elementos de rol. O xogo está dispoñible para Microsoft Windows, Mac OS X e varias distribucións GNU/Linux.

source: <a href='#game'>What’s New in Wesnoth 1.10</a>
gl: <a href='#game'>Novidades da versión 1.10</a>

source: <a href='#players'>For Players</a>
gl: <a href='#players'>Para os usuarios</a>

source: <a href='#general'>General</a>
gl: <a href='#general'>Xeral</a>

source: <a href='#campaigns'>Campaigns</a>
gl: <a href='#campaigns'>Campañas</a>

source: <a href='#multiplayer'>Multiplayer</a>
gl: <a href='#multiplayer'>Varios xogadores</a>

source: <a href='#campdev'>For Content Developers</a>
gl: <a href='#campdev'>Para os desenvolvedores de contidos</a>

source: <a href='#download'>Download</a>
gl: <a href='#download'>Descarga</a>

source: <a href='#more'>More Info</a>
gl: <a href='#more'>Información adicional</a>

source: What’s New in Wesnoth 1.10
gl: Novidades da versión 1.10

source: Wesnoth Screenshot
gl: Captura de pantalla de A batalla por Wesnoth.

source: For Players
gl: Para os usuarios

source: To help you quickly identify slowed units, they are now tinted light blue. Various improvements were made to the sidebar to make it more appealing and to make its elements easier to grasp.
gl: Para facilitar a identificación de unidades <span style="font-style: oblique;">ralentizadas</span>, agora tínguense lixeiramente de azul. Ademais, a barra lateral recibiu numerosas melloras tanto para facela máis agradábel como para facilitar a súa lectura.

source: Thanks to the Google Summer of Code projects from 2010 and 2011, there is a new <cite>Whiteboard</cite> system, which can help you make plans by allowing you to visualize recruitment, movements, attacks, and so forth. It can even let you visualize shared plans with your allies in multiplayer games.
gl: Grazas aos proxectos do <em>Google Summer of Code</em> durante os anos 2010 e 2011, incluíuse un sistema de <cite>planificación</cite>, co que se poderán visualizar os recrutamentos, movementos, ataques e demais antes de levalos a cabo. Mesmo se poden coordinar plans nas partidas de varios xogadores!

source: General
gl: Xeral

source: Various units, such as the saurians, have gotten new standing animations. These along with the new animated water help breathe life into the previously near-motionless battlefield.
gl: Varias unidades, entre elas as dos saurios, recibiron novas animacións para cando non están a facer nada. Estas animacións, xunto coas novas animacións da auga, axudarán a darlle máis vida ao campo de batalla.

source: Many portraits were added and updated, thus getting us closer to meeting our goals for completeness and having high-quality art throughout the game.
gl: Engadíronse e actualizáronse moreas de retratos de unidades, achegándonos así ao noso obxectivo de completalos todos e contar no xogo con imaxes de gran calidade, tanto no sentido artístico coma no dixital.

source: Lots of new terrains have also been added, thus allowing the possibility of far more interesting maps for players to enjoy.
gl: Tamén se engadiron moitos terreos, multiplicando as posibilidades á hora de crear novos mapas, e permitindo por tanto facelos máis interesantes.

source: The lighting system can now illuminate specific areas differently to better show local time of the day effects and, for example, keep caves dark during the day.
gl: Agora o sistema de iluminación pode afectar de xeito distinto a diferentes zonas dos mapas, permitindo así mellorar a representación de mapas que contan tanto con partes ao aire libre como con partes cubertas (coma covas).

source: Substantial improvements have been made in regards to UI design, typography, and consistency.
gl: Leváronse a cabo importantes melloras no deseño e consistencia da interface do xogo, incluíndo tamén cambios nos tipos de letra empregados.

source: Various UI improvements have also been made. For example, you can now have Wesnoth use the twelve-hour clock format thanks to a new advanced preference. Another fine example is now being able to remove multiple add-ons at once using checkboxes.
gl: Tamén se melloraron outros aspectos da interface. Por exemplo, agora pódese configurar o reloxo do xogo para que amose a hora en formato de 12 horas, ou eliminar varios complementos dunha vez —mediante caixas que se poden marcar—.

source: The 1.10 series features a completely redone version of the old <em>Northerners</em> track as well as a new track: <em>Battle Epic</em>.
gl: A póla 1.10 inclúe ademais unha revisión completa do vello escenario <em>Nórdicos</em>, así como un escenario novo: <em>Os herbais de Moquena</em>.

source: Also, two new translations were started: Irish and Old English.
gl: Ademais, comezou a tradución do xogo a dúas novas linguas: o irlandés e o inglés antigo. Sobre a tradución ao galego, o núcleo do xogo revisouse completamente, quedando só algunhas campañas oficiais por revisar e completar antes de empezar a traballar na tradución de campañas da comunidade. A tradución irá progresando con cada nova versión desta póla 1.10.

source: Campaigns
gl: Campañas

source: The campaign <em>Dead Water</em> is now in mainline. In it, you play a young merman who is the heir to his kingdom’s throne; your task is to repel an undead invasion. <em>Dead Water</em> spent some time being polished in the <a href="http://wesnoth-umc-dev.sourceforge.net">Wesnoth-UMC-Dev project</a> to prepare for mainline inclusion, just like <em>Delfador’s Memoirs</em> from the 1.8 series.
gl: A campaña <em>Augas Mortas</em> incluíuse entre as oficiais. Nela, o xogador ponse na pel dun mozo sirénido herdeiro ao trono do seu reino, que debe enfrontarse a unha invasión de non mortos. Para isto, <em>Augas Mortas</em> pasou un tempo no <a href="http://wesnoth-umc-dev.sourceforge.net">proxecto <em>Wesnoth-UMC-Dev</em></a>, onde se estivo adaptando e preparando para poder aspirar a ese status de oficial, tal e como ocorrera con <em>As memorias de Delfador</em> para a póla 1.8.

source: Most of the existing campaigns have received both minor and major updates and improvements. For example, <em>A Tale of Two Brothers</em>’ storyline was significantly improved, and several of <em>Legend of Wesmere</em>’s scenarios were reworked to include more dynamic gameplay and improved mechanics.
gl: A meirande parte das campañas recibiron algún tipo de actualización ou mellora, grande ou pequena. Por exemplo, o guión de <em>Un conto sobre dous irmáns</em> mellorouse de maneira significativa, e moitos dos escenarios de <em>A lenda de Wesmere</em> revisáronse para dinamizalos e mellorar o seu funcionamento.

source: Multiplayer
gl: Varios xogadores

source: Several new multiplayer maps have been introduced: Aethermaw, Arcanclave Citadel, Thousand Stings Garrison, and Volcano. Numerous updates and balancing tweaks were made to other maps &mdash; including making use of the new terrains.
gl: Engadíronse unha morea de mapas para varios xogadores: «Édermo», «A cidadela de Arcanclave», «A fortaleza das mil cadeas» e «O volcán». Outros mapas foron equilibrados e actualizados —por exemplo, con novos terreos—.

source: For Content Developers
gl: Para os desenvolvedores de contidos

source: The 1.10 series brings a lot of new features for content developers, such as the new <a href="http://wiki.wesnoth.org/PersistenceWML">persistent variables</a> feature, which allows add-on authors to save data to players’ hard disks for use by other content or in future playthroughs.
gl: A póla 1.10 trae consigo unha morea de novas funcionalidades para os desenvolvedores de contidos, como poden ser as novas <a href="http://wiki.wesnoth.org/PersistenceWML">variábeis persistentes</a>, coas que os autores de complementos poderán gardar información no disco duro dos xogadores para usala dende outros complementos ou en futuros encontros.

source: The game’s Lua capabilities have been strengthened considerably, thus allowing content developers to do much more then they could with it on the 1.8 series. In fact, one of our Google Summer of Code projects was focused on improving the AI-related Lua capabilities.
gl: As capacidades do xogo para coa linguaxe Lua reforzáronse considerabelmente, grazas ao cal os desenvolvedores de contidos poderán facer moito máis que na anterior póla estábel. De feito, un dos nosos proxectos do <em>Google Summer of Code</em> consistiu en melloras as capacidades de Lua relativas á intelixencia artificial.

source: Thanks to revisions in the code that handles <a href="http://wiki.wesnoth.org/LanguageWML">[language]</a>, custom range and attack type strings can now be translated.
gl: Grazas ás revisións do código responsábel da etiqueta WML <a href="http://wiki.wesnoth.org/LanguageWML">[language]</a>, agora é posíbel traducir o texto dos ataques personalizados.

source: The terrain palette has been vastly expanded with the addition of new basic terrains as well as new structures and embellishments, thus allowing map makers to create more vibrant maps.
gl: A paleta de terreos incrementouse amplamente, recibindo tanto novos terreos fundamentais como novas estruturas e elementos de decoración, o que permitirá aos autores dotar de máis vida e variedade aos seus mapas.

source: Thanks to a Google Summer of Code project that took place during 2010 and 2011, we now have a <a href="http://eclipse.wesnoth.org">Wesnoth Eclipse plugin</a>, which provides a fullblown IDE for WML in Eclipse thus providing features such as syntax highlighting, tag folding, autocompletion, and more. It even has frontends for maintenance tools such as wmllint and wmlindent as well as the ability to start the game or map editor and have it go right to the desired scenario or map.
gl: Grazas a un dos proxectos do <em>Google Summer of Code</em>, que desenvolveu durante os anos 2010 e 2011, dispoñemos agora dun <a href="http://eclipse.wesnoth.org">complemento de Wesnoth para Eclipse</a>, que engade a Eclipse todo o necesario para traballar comodamente coa linguaxe WML, con salientado da sintaxe, completado automático, e máis. O complemento inclúe ata interfaces para ferramentas de mantemento tales coma <em>wmllint</em> e <em>wmlindent</em>, así como a posibilidade de iniciar o xogo ou o editor de escenarios directamente nun escenario ou mapa concreto.

source: A new batch of item icons&mdash;drawn in the same style as the attack icons&mdash;have been included for the benefit of content creators; depictions of items such as potions, robes, armor, and jewelry are included.
gl: Incluíuse unha nova serie de iconas de obxectos, debuxadas co mesmo estilo que as iconas de ataques, para que poidan usalas os autores de mapas. Entre os obxectos inclúense pocións, cordas, armaduras, e xoias.

source: Download
gl: Descarga

source: <em>The Battle for Wesnoth</em> is made available under the <a href='http://www.gnu.org/licenses/gpl-2.0.html'>GNU General Public License</a> (GPL). The source code is available from <a href='http://www.wesnoth.org'>wesnoth.org</a>, where you can also find instructions for <a href='http://wiki.wesnoth.org/CompilingWesnoth'>building from source</a> on a range of different operating systems. Ready-to-go packages are also available for most popular operating systems, including Microsoft Windows, Mac OS X, and GNU/Linux.
gl: <em>A batalla por Wesnoth</em> publícase baixo a <a href='http://www.mancomun.org/fileadmin/user_upload/Licenzas/gpl2_gl.txt'>Licenza Pública Xeral de GNU</a> (GPL). O código fonte está dispoñible no sitio web <a href='http://www.wesnoth.org'>wesnoth.org</a>, onde hai ademais instrucións para <a href='http://wiki.wesnoth.org/CompilingWesnoth'>compilalo</a> nunha gran variedade de sistemas operativos. Tamén hai dispoñíbeis paquetes para os sistemas operativos máis populares, entre eles Microsoft Windows, Mac OS X e GNU/Linux.

source: <strong> <a href='http://sourceforge.net/projects/wesnoth/files/wesnoth-1.10/wesnoth-1.10/wesnoth-1.10.tar.bz2/download'>Source code</a> </strong>
gl: <strong> <a href='http://sourceforge.net/projects/wesnoth/files/wesnoth-1.10/wesnoth-1.10/wesnoth-1.10.tar.bz2/download'>Código fonte</a> </strong>

source: <strong> <a href='http://sourceforge.net/projects/wesnoth/files/wesnoth-1.10/wesnoth-1.10/wesnoth-1.10-win32.exe/download'>Wesnoth for Microsoft Windows</a> </strong>
gl: <strong> <a href='http://sourceforge.net/projects/wesnoth/files/wesnoth-1.10/wesnoth-1.10/wesnoth-1.10-win32.exe/download'>Wesnoth para Microsoft Windows</a> </strong>

source: <strong> <a href='http://sourceforge.net/projects/wesnoth/files/wesnoth-1.10/wesnoth-1.10/Wesnoth_1.10.dmg/download'>Wesnoth for Mac OS X</a> </strong>
gl: <strong> <a href='http://sourceforge.net/projects/wesnoth/files/wesnoth-1.10/wesnoth-1.10/Wesnoth_1.10.dmg/download'>Wesnoth para Mac OS X</a> </strong>

source: You can get up-to-date information on downloads at the <a href='http://wiki.wesnoth.org/Download'>downloads page</a>. There you can also find packages and instructions for other platforms once they are available.
gl: Podes obter información actualizada sobre as descargas na <a href='http://wiki.wesnoth.org/Download'>páxina de descargas</a>. Alí podes atopar tamén paquetes e instrucións para outras plataformas en canto estas estean dispoñíbeis.

source: If you downloaded previous versions of the game, you might be interested in downloading the <a href='http://wiki.wesnoth.org/Download_Xdeltas'>xdelta</a> files only.
gl: Se descargaches unha versión anterior do xogo, quizais che interese descargar só os ficheiros <a href='http://wiki.wesnoth.org/Download_Xdeltas'>xdelta</a>.

source: More Info
gl: Información adicional

source: <a href='http://svn.gna.org/viewcvs/*checkout*/wesnoth/tags/1.10.0/changelog'>Full Changelog</a> (English, very long)
gl: <a href='http://svn.gna.org/viewcvs/*checkout*/wesnoth/tags/1.10.0/changelog'>Lista de cambios completa</a> (en inglés, moi longa)

source: <a href='http://svn.gna.org/viewcvs/*checkout*/wesnoth/tags/1.10.0/doc/manual/manual.en.html'>User’s Manual</a>
gl: <a href='http://svn.gna.org/viewcvs/*checkout*/wesnoth/tags/1.10.0/doc/manual/manual.gl.html'>Manual do usuario</a>

source: <a href='http://www.wesnoth.org'>Official Website</a> (English)
gl: <a href='http://www.wesnoth.org'>Sitio web oficial</a> (en inglés)

source: <a href='http://www.wesnoth.org/start/1.4'>Wesnoth 1.4 Release Notes</a>
gl: <a href='http://www.wesnoth.org/start/1.4'>Notas do lanzamento da versión 1.4 de A batalla por Wesnoth</a>

source: <a href='http://www.wesnoth.org/start/1.6'>Wesnoth 1.6 Release Notes</a>
gl: <a href='http://www.wesnoth.org/start/1.6'>Notas do lanzamento da versión 1.6 de A batalla por Wesnoth</a>

source: <a href='http://www.wesnoth.org/start/1.8'>Wesnoth 1.8 Release Notes</a>
gl: <a href='http://www.wesnoth.org/start/1.8'>Notas do lanzamento da versión 1.8 de A batalla por Wesnoth</a>

source: This page is also available in the following languages:
gl: Esta páxina tamén está dispoñíbel nas seguintes linguas:
